#include <stdio.h>
#include <math.h>
#include <windows.h>

main() {
    //виставляю кодировку виводу консолі в UTF-8
    SetConsoleOutputCP(65001);
    SetConsoleCP(65001);

    //Умова задачі
    // Координати двох полів шахової дошки задані у вигляді двох пар  чисел 
    // x1, y1 та x2, y2. На першому полі стоїть ферзь, на другому – кінь.  
    // Написати програму, яка визначає, чи б'є ферзь коня, кінь – ферзя, 
    // чи  фігури не загрожують одна одній. 

    //створюємо змінні
    int x1, x2, y1, y2; //координати фігур
    
    int dx, dy, Q, K;
    //dx -  відстань фігур за координатою х
    //dy - відстань фігур за координатою y
    //Q - змінна для перевірки як б'є ферзь
    //K - змінна для перевірки як б'є кінь

    //зчитуємо значення змінних x1, y1, x2, y2 та перевіряємо на обмеження за розміров дошки 8х8
    printf("Введіть координати для ферзя(0 < x, y < 9): ");
    scanf("%d %d", &x1, &y1);
    if (x1 < 1 || y1 < 1 || x1 >8 || y1 > 8)  {
        printf("Невірні дані, спробуйте ще раз!");
        return 0;
    }

    printf("Введіть координати для коня(0 < x, y < 9): ");
    scanf("%d %d", &x2, &y2);
     if (x2 < 1 || y2 < 1 || x2 >8 || y2 > 8)  {
        printf("Невірні дані, спробуйте ще раз!");
        return;
    }

    if (x1 == x2 && y1 == y2){ //перевіряємо чи знаходяться фігури на одній координаті
        printf("ERROR, фігури знаходяться на одній координаті");
        return;
    }

    //обчисляємо відстань між фігурами за координатами
    dx = abs(x1 - x2);
    dy = abs(y1 - y2);

    //обчислюємо як б'ють фігури
    Q = x1 == x2 || y1 == y2 || dx == dy;
    K = dx == 2 && dy == 1 || dx == 1 && dy == 2;

    //перевіряємо чи б'є одна фігури іншу
    if (Q && !K) {
        printf("Ферзь б'є коня");
        return;
    } else if (K && !Q){
        printf("Кінь б'є ферзя");
        return;
    } else if (Q && K){
        printf("Загроза для обох");
        return;
    } else {
        printf("Загрози один до одного немає");
        return;
    }
}